//
//  Lyric+Preview.swift
//  SwiftSound
//
//  Created by Jinchao Lin on 2026/7/2.
//

import Foundation

// swiftlint:disable line_length
#if DEBUG
extension Lyric {
    static let preview = Lyric(
        version: 60,
        lyric:
"""
[00:00.00] 编曲 : 陈珀/C. Y. Kong\n[00:01.00] 作词 : 林夕\n[00:02.00] 作曲 : Christopher Chak\n[00:24.90]拦路雨偏似雪花 饮泣的你冻吗\n[00:29.46]这风褛我给你磨到有襟花\n[00:34.83]连调了职也不怕 怎么始终牵挂\n[00:40.04]苦心选中今天想车你回家\n[00:45.04]原谅我不再送花 伤口应要结疤\n[00:49.77]花瓣铺满心里坟场才害怕\n[00:55.09]如若你非我不嫁 彼此终必火化\n[01:00.28]一生一世等一天需要代价\n[01:05.38]谁都只得那双手 靠拥抱亦难任你拥有\n[01:11.09]要拥有必先懂失去怎接受\n[01:16.04]曾沿着雪路浪游 为何为好事泪流\n[01:21.65]谁能凭爱意要富士山私有\n[01:26.37]何不把悲哀感觉 假设是来自你虚构\n[01:31.44]试管里找不到它染污眼眸\n[01:36.48]前尘硬化像石头 随缘地抛下便逃走\n[02:00.83]点解每晚 都有咁样嘅嘢人 喺度嗌生晒\n[02:10.12]情人节不要说穿 只敢抚你发端\n[02:14.80]这种姿态可会令你更心酸\n[02:19.75]留在汽车里取暖 应该怎么规劝\n[02:24.52]怎么可以将手腕忍痛划损\n[02:29.51]人活到几岁算短 失恋只有更短\n[02:34.31]归家需要几里路谁能预算\n[02:39.13]忘掉我跟你恩怨 樱花开了几转\n[02:44.19]东京之旅一早比一世遥远\n[02:49.07]谁都只得那双手 靠拥抱亦难任你拥有\n[02:54.43]要拥有必先懂失去怎接受\n[02:59.02]曾沿着雪路浪游 为何为好事泪流\n[03:04.02]谁能凭爱意要富士山私有\n[03:08.78]何不把悲哀感觉 假设是来自你虚构\n[03:13.62]试管里找不到它染污眼眸\n[03:18.56]前尘硬化像石头 随缘地抛下便逃走\n[03:27.49]我绝不罕有 往街里绕过一周 我便化乌有\n[03:37.58]谁都只得那双手 靠拥抱亦难任你拥有\n[03:42.52]要拥有必先懂失去怎接受\n[03:47.13]曾沿着雪路浪游 为何为好事泪流\n[03:52.44]谁能凭爱意要富士山私有\n[03:57.06]何不把悲哀感觉 假设是来自你虚构\n[04:01.87]试管里找不到它染污眼眸\n[04:06.67]前尘硬化像石头 随缘地抛下便逃走\n[04:17.32]我绝不罕有 往街里绕过一周 我便化乌有\n[04:30.80]你还嫌不够 我把这陈年风褛 送赠你解咒\n[04:42.23]\n
"""
    )
}

extension LyricLine {
    static let preview = LyricLine(
        time: 2490,
        text: "拦路雨偏似雪花 饮泣的你冻吗"
    )
}

#endif
// swiftlint:enable line_length
